from bot.base import *

@bot.message_handler(func=lambda message: True and message.text == "📚 راهنمای استفاده",user_status=False,
                     content_types=['text'],is_ban=False)
async def help_message(message: telebot.types.Message):
    chat_id = message.chat.id
    text = """
    🔐 توصیه‌های حفظ حریم خصوصی:
<blockquote>
- هرچند که ما تمام تلاش خود را برای ایجاد یک محیط امن و ناشناس بکار برده‌ایم، لازم است کاربران نیز در حفظ حریم خصوصی خود فعال باشند. همیشه به خاطر داشته باشید که طرف مقابل شما نیز ناشناس است و ممکن است هر فردی باشد.

- در حفظ اطلاعات شخصی و حساس خود کوشا باشید و از ارسال اطلاعاتی که ممکن است شما را آسیب‌پذیر کند، خودداری کنید.

- اگر تمایل دارید که با شخصی در خارج از ربات ارتباط برقرار کنید، پیش از انجام این کار، با دقت تمام فکر کنید. به محض اینکه اطلاعات شخصی خود را به اشتراک بگذارید، هویت ناشناس شما فاش خواهد شد.

- در صورت نیاز به ارسال اطلاعات حساس، می‌توانید یک حساب تلگرام با شماره ناشناس بسازید و اطلاعات را به صورت پیام خصوصی و مستقیم به کاربر مربوط ارسال کنید.

- برای حفظ حریم خصوصی بیشتر، می‌توانید با استفاده از یک شماره مجازی یا ناشناس، حساب کاربری جدیدی ایجاد کرده و با آن در ربات عضو شوید.

توجه داشته باشید که هویت تمامی کاربران در ربات ناشناس است و هیچ کسی هویت دیگری را نمی‌داند، مگر اینکه خود فرد تصمیم به فاش کردن آن بگیرد.
</blockquote>

⚠️ تذکر مهم:
<blockquote>
در صورتی که شما با خواندن این مستندات فنی، ابهام یا سوالی دارید، توصیه می‌شود پیش از استفاده از ربات، ابتدا از شخصی مطلع و قابل اعتماد سوال کنید و پس از دریافت توضیحات کافی و اطمینان از نحوه عملکرد ربات، از آن استفاده نمایید.

لطفاً توجه داشته باشید که هر گونه مسئولیت ناشی از استفاده از ربات بر عهده خود کاربر است. ما به عنوان توسعه‌دهندگان، تمام تلاش خود را برای ایجاد یک محیط امن و حفاظت از حریم خصوصی شما به کار برده‌ایم، اما امنیت و حفظ حریم خصوصی در استفاده از اینترنت به همکاری و دقت هر فرد نیز وابسته است
</blockquote>
"""
    await bot.send_message(chat_id,text)